{"loss": "sparse_categorical_crossentropy", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "convolution2d_1", "nb_filter": 32, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "relu", "batch_input_shape": [null, 1, 28, 28], "input_dtype": "float32", "dim_ordering": "th", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "nb_col": 3, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "relu", "dim_ordering": "th", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "relu", "dim_ordering": "th", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "relu", "dim_ordering": "th", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "softmax", "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "input_dim": null, "bias": true}}], "sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"momentum": 0.0, "name": "SGD", "nesterov": false, "decay": 0.0, "lr": 9.999999747378752e-05}, "keras_version": "1.0.4"}