{"class_name": "Sequential", "sample_weight_mode": null, "optimizer": {"lr": 9.999999747378752e-06, "decay": 0.0, "name": "SGD", "nesterov": false, "momentum": 0.0}, "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "batch_input_shape": [null, 3, 100, 100], "b_regularizer": null, "nb_row": 3, "trainable": true, "input_dtype": "float32", "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "name": "convolution2d_5", "nb_filter": 32}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "name": "convolution2d_6", "nb_filter": 32}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "name": "convolution2d_7", "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "name": "convolution2d_8", "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "softmax", "input_dim": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "output_dim": 11}}], "loss": "sparse_categorical_crossentropy", "keras_version": "1.0.4"}